bpel.samples/resources/BluePrint5/BluePrint5/src/Reservation.wsdl

<?xml version="1.0" encoding="utf-8" ?>
<!--
  Copyright (c) 2010, Oracle. All rights reserved.

  Redistribution and use in source and binary forms, with or without
  modification, are permitted provided that the following conditions are met:

  * Redistributions of source code must retain the above copyright notice,
    this list of conditions and the following disclaimer.

  * Redistributions in binary form must reproduce the above copyright notice,
    this list of conditions and the following disclaimer in the documentation
    and/or other materials provided with the distribution.

  * Neither the name of Oracle nor the names of its contributors
    may be used to endorse or promote products derived from this software without
    specific prior written permission.

  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
  ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE
  LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
  CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
  SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
  INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
  CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
  ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF
  THE POSSIBILITY OF SUCH DAMAGE.
-->
<definitions targetNamespace="http://localhost/BluePrint5/Reservation"
             name="Reservation"
             xmlns:bpws="http://docs.oasis-open.org/wsbpel/2.0/varprop"             
             xmlns:tns="http://localhost/BluePrint5/Reservation"
             xmlns:xsd="http://www.w3.org/2001/XMLSchema"
             xmlns="http://schemas.xmlsoap.org/wsdl/"
             xmlns:plink="http://docs.oasis-open.org/wsbpel/2.0/plnktype"
             xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
             xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:ns="http://ReservationSystem.org/xsd/reserve">
    <types>
        <xsd:schema targetNamespace="http://localhost/BluePrint5/Reservation">
            <xsd:import schemaLocation="reservation.xsd" namespace="http://ReservationSystem.org/xsd/reserve"/>
            <xsd:element name="faultString" type="xsd:string"/>
        </xsd:schema>
    </types>

    <message name="reserveMesg">
        <part name="reservePart" element="ns:reserve"></part>
    </message>

    <message name="reservationStatus">
        <part name="reservationStatusPart" element="ns:reservationStatusOfAll"></part>
    </message>

    <message name="reservationFailed">
        <part name="faultInfo" element="tns:faultString"></part>
    </message>

    <portType name="doReservePortType">
        <operation name="reserve">
            <input name="reserveMesg" message="tns:reserveMesg"></input>
            <output name="reservationStatus" message="tns:reservationStatus"></output>
            <fault name="reservationFailed" message="tns:reservationFailed"></fault>
        </operation>
    </portType>
    
    <binding name="reservationBinding" type="tns:doReservePortType">
        <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="reserve">
            <input name="reserveMesg">
                <soap:body parts="reservePart" use="literal"/>
            </input>
            <output name="reservationStatus">
                <soap:body parts="reservationStatusPart" use="literal"/>
            </output>
            <fault name="reservationFailed">
                <soap:fault name="reservationFailed" use="literal"/>
            </fault>
        </operation>
    </binding>

    <service name="reservationService">
        <port name="reservationServicePort"
              binding="tns:reservationBinding">
            <soap:address location="http://localhost:18181/wsdl/ReservationService/ServiceLocation"/>
        </port>
    </service>
    
    <plink:partnerLinkType name="reservationPLinkType">
        <plink:role name="reservationServicing" portType="tns:doReservePortType"></plink:role>
    </plink:partnerLinkType>

    <bpws:property name="reservationID" type="xsd:long"></bpws:property>
    
    <bpws:propertyAlias part="reservePart"
                        propertyName="tns:reservationID"
                        messageType="tns:reserveMesg">
        <bpws:query>/ns:reserve/ns:reservationID</bpws:query>
    </bpws:propertyAlias>
</definitions>
