bpel.samples/resources/BluePrint5/BluePrint5Application/test/TestCase2/Input.xml

<soapenv:Envelope 
  xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
  xmlns:res="http://ReservationSystem.org/xsd/reserve">
  <soapenv:Body>
    <res:reserve>
      <res:reservationID>0000098761</res:reservationID>
      <res:description>book_car, book_hotel, book_airline</res:description>
    </res:reserve>
  </soapenv:Body>
</soapenv:Envelope>
