bpel.samples/resources/BluePrint5/BluePrint5Application/test/TestCase2/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header/>
  <SOAP-ENV:Body>
    <reservationStatusOfAll xmlns="http://ReservationSystem.org/xsd/reserve">
      <airlineStatus>true</airlineStatus>
      <hotelStatus>true</hotelStatus>
      <carStatus>true</carStatus>
    </reservationStatusOfAll>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>